#coding:utf8
from __future__ import unicode_literals
from flask import Flask
from flask import (
    g, request, redirect, flash, Response, render_template, Markup)
app = Flask(__name__)

@app.route("/")
def index():
    return render_template("index.html")

@app.route("/info/get/news")
def news_info():
    rs="""
    [
{"发送时间":"2016/3/1","标题":"通知聚会1","内容":"1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀","有效期到":"2017/3/7"," 发送人真实姓名":"周耀1","发送人昵称":"住羽光1"},
{"发送时间":"2016/3/2","标题":"通知聚会2","内容":"2又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀","有效期到":"2017/3/8"," 发送人真实姓名":"周耀2","发送人昵称":"住羽光2"},
{"发送时间":"2016/3/3","标题":"通知聚会3","内容":"3又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:31如果不能来请联系周耀","有效期到":"2017/3/9"," 发送人真实姓名":"周耀3","发送人昵称":"住羽光3"},
{"发送时间":"2016/3/4","标题":"通知聚会4","内容":"4又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:31如果不能来请联系周耀","有效期到":"2017/3/10"," 发送人真实姓名":"周耀4","发送人昵称":"住羽光4"},
{"发送时间":"2016/3/5","标题":"通知聚会5","内容":"5又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:32如果不能来请联系周耀","有效期到":"2017/3/11"," 发送人真实姓名":"周耀5","发送人昵称":"住羽光5"},
{"发送时间":"2016/3/6","标题":"通知聚会6","内容":"6又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:32如果不能来请联系周耀","有效期到":"2017/3/12"," 发送人真实姓名":"周耀6","发送人昵称":"住羽光6"},
{"发送时间":"2016/3/7","标题":"通知聚会7","内容":"7又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:33如果不能来请联系周耀","有效期到":"2017/3/13"," 发送人真实姓名":"周耀7","发送人昵称":"住羽光7"},
{"发送时间":"2016/3/8","标题":"通知聚会8","内容":"8又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:33如果不能来请联系周耀","有效期到":"2017/3/14"," 发送人真实姓名":"周耀8","发送人昵称":"住羽光8"},

]
    """
    return render_template("news.html",news=rs)

@app.route("/info/get/contact")
def contact():
    rs = """
[
{"编号":"0","姓名":"张一1","学号":"45121600","联系方式":"18892334567","寝室号":"3栋225","是否室长":"是","性别":"女","地址":"河南省许昌市禹州市1"},
{"编号":"1","姓名":"张一2","学号":"45121601","联系方式":"18892334568","寝室号":"14栋426","是否室长":"否","性别":"男","地址":"河南省许昌市禹州市2"},
{"编号":"2","姓名":"张一3","学号":"45121602","联系方式":"18892334569","寝室号":"3栋214","是否室长":"是","性别":"女","地址":"河南省许昌市禹州市3"},
{"编号":"3","姓名":"张一4","学号":"45121603","联系方式":"18892334570","寝室号":"3栋225","是否室长":"否","性别":"女","地址":"河南省许昌市禹州市4"},
{"编号":"4","姓名":"张一5","学号":"45121604","联系方式":"18892334571","寝室号":"6栋211","是否室长":"是","性别":"男","地址":"河南省许昌市禹州市5"},
{"编号":"5","姓名":"张一6","学号":"45121605","联系方式":"18892334572","寝室号":"3栋212","是否室长":"是","性别":"女","地址":"河南省许昌市禹州市6"},
{"编号":"6","姓名":"张一7","学号":"45121606","联系方式":"18892334573","寝室号":"14栋432","是否室长":"否","性别":"男","地址":"河南省许昌市禹州市7"},
{"编号":"7","姓名":"张一8","学号":"45121607","联系方式":"18892334574","寝室号":"15栋611","是否室长":"否","性别":"女","地址":"河南省许昌市禹州市8"},
{"编号":"8","姓名":"张一9","学号":"45121608","联系方式":"18892334575","寝室号":"3栋222","是否室长":"否","性别":"女","地址":"河南省许昌市禹州市9"},
{"编号":"9","姓名":"张一10","学号":"45121609","联系方式":"18892334576","寝室号":"14栋426","是否室长":"否","性别":"男","地址":"河南省许昌市禹州市10"},

]
    """
    return render_template("contact.html",contact=rs)

@app.errorhandler(404)
def page_not_found(error):
    return render_template('page_not_found.html'), 404

if __name__ == "__main__":
    app.run()