#coding:utf8
from __future__ import unicode_literals
from flask import Flask
from flask import (
    g, request, redirect, flash, Response, render_template, Markup)
app = Flask(__name__)

@app.route("/news")
def news_info():
    rs="""[
        {"2016/3/1":"2016/3/2","通知聚会1":"通知聚会2","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"2又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀","2017/3/7":"2017/3/8","周耀1":"周耀2","住羽光1":"住羽光2"},
        {"2016/3/1":"2016/3/3","通知聚会1":"通知聚会3","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"3又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:31如果不能来请联系周耀","2017/3/7":"2017/3/9","周耀1":"周耀3","住羽光1":"住羽光3"},
        {"2016/3/1":"2016/3/4","通知聚会1":"通知聚会4","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"4又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:31如果不能来请联系周耀","2017/3/7":"2017/3/10","周耀1":"周耀4","住羽光1":"住羽光4"},
        {"2016/3/1":"2016/3/5","通知聚会1":"通知聚会5","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"5又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:32如果不能来请联系周耀","2017/3/7":"2017/3/11","周耀1":"周耀5","住羽光1":"住羽光5"},
        {"2016/3/1":"2016/3/6","通知聚会1":"通知聚会6","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"6又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:32如果不能来请联系周耀","2017/3/7":"2017/3/12","周耀1":"周耀6","住羽光1":"住羽光6"},
        {"2016/3/1":"2016/3/7","通知聚会1":"通知聚会7","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"7又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:33如果不能来请联系周耀","2017/3/7":"2017/3/13","周耀1":"周耀7","住羽光1":"住羽光7"},
        {"2016/3/1":"2016/3/8","通知聚会1":"通知聚会8","1又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:30如果不能来请联系周耀":"8又到一年春天的时候，计划在2-7号，班级举办一次聚会。地点在万宜广场，时间晚上6:33如果不能来请联系周耀","2017/3/7":"2017/3/14","周耀1":"周耀8","住羽光1":"住羽光8"},
    ]"""
    return render_template("news.html",news=rs)

if __name__ == "__main__":
    app.run()